/**
 * @file AgreementCN.js
 * @author zmh3788
 * @description 多语言的协议
 */

import React, {
    Component
} from 'react';


import style from './AgreementStyle.scss';
export default class AgreementCn extends Component {
    render() {
        return (
            <div className={style.break}>
                <p>请认真阅读本协议，并确保您能充分理解keypair的相关内容以及本协议中的各项条款。</p>
                <p>最后更新日期：2019年 月 日</p>
                <p>1.接受条款</p>
                <p>keypair（以下简称“服务”）提供用于管理多个区块链账户、身份和声誉的单一应用程序；允许其他应用程序与keypair交互，以提供身份验证和声誉以及用于各种区块链或其他证明的数字签名。任何随附材料，如教程、代码、书面文档和其他keypair发布的内容也属于本协议。
                用户通过弹出窗口控制自己的数字资产（例如密钥对和令牌），允许用户接受或拒绝事务、信息请求和添加请求。</p>
                <p>请在使用keypair服务之前仔细阅读条款。您确认（1）接受并同意这些条款（2）同意收集、使用、披露和其他处理我们隐私政策中所述的信息（3）传播公司随时发布的任何其他参与条款、规则和条件。
                如果您不同意这些条款，则不能访问或使用内容或服务。</p>
                <p>2.修改使用条款</p>
                <p>keypair保留在任何时候修改或替换使用条款的权利。这些术语的最新版本将发布在https://get-keypair.com上。您应负责审查并熟悉任何此类修改。您在对条款进行任何修改后使用服务，即表示您接受修改后的使用条款。</p>
                <p>3.合格性</p>
                <p>请您在此声明并保证，您完全有能力签署本条款中规定的条款、条件、义务、声明、陈述和保证，并遵守本条款。
                keypair是一个全球平台，请您确认并保证，您在您的司法管辖区中拥有民事行为能力，且您所处的地域允许您使用相关服务。</p>
                <p>4.帐户密码和安全性</p>
                <p>设置keypair时，您将负责保留自己的帐户机密，这些机密可能是12个单词的种子短语、备份文件、密码、密钥对或其他本地存储的机密信息。keypair使用从您提供的密码，在本地加密这些信息，我们从不将其发送到服务器。
                您同意（a）不得使用与您在本服务之外使用过的相同的keypair密码；（b）对您的机密信息和密码保密，不得与任何其他人共享。</p>
                <p>对于因您不遵守本节而造成的任何损失或损害，keypair公司不承担任何责任。通过使用keypair，您可以将自己识别为自己的密钥、密码、种子短语和其他私人数据的唯一合法所有者。</p>
                <p>5.陈述、保证和风险</p>
                <p>5.1担保解除声明</p>
                <p>您明确理解并同意，您使用本服务的风险由您自行承担。服务（包括服务和网站）是在“现状”和“可用”的基础上提供的，没有任何形式的明示或暗示保证，包括但不限于对适销性、特定用途适用性或非侵权的保证。您承认，keypair无法控制，也没有义务对以下行为采取任何行动：哪些用户可以访问或使用服务；内容可能对您有什么影响；您如何解释或使用内容；您可能采取的行动。
                您免除keypair您通过服务获得或未获得内容的所有责任。keypair对包含在服务中或通过服务访问的任何内容不做任何陈述，并且keypair对包含在服务中或通过服务访问的材料的准确性、版权合规性、合法性或合理性不承担任何责任。</p>
                <p>5.2密码系统的复杂性和风险</p>
                <p>>通过以任何方式利用服务或与内容或平台交互，您表示您了解与加密系统相关的固有风险；并保证您了解本地加密令牌、遵循基于ockchain的软件系统的、各种令牌标准的、基于智能合约的令牌以及BL的使用和复杂性。</p>
                <p>5.3一个或多个司法管辖区的监管行动风险</p>
                <p>keypair和支持的区块链和令牌可能会受到一个或多个监管查询或监管行动的影响，这些查询或监管行动可能会阻碍或限制keypair继续发展的能力，或者可能会阻碍或限制您访问或使用服务或支持的区块链及其网络的能力。</p>
                <p>5.4密码技术领域的弱点或漏洞利用风险</p>
                <p>您承认并理解，密码学是一个进步的领域。密码破解的进步或量子计算机的发展等技术进步可能会给加密货币和服务带来风险，这可能会导致您的数字资产（如密钥对、加密令牌或财产）被盗或丢失。在可能的范围内，keypair打算更新服务底层的协议以说明密码技术的任何进步，并加入额外的安全措施，但不保证或以其他方式表示系统的完整安全性。通过使用服务，您认识到了这些固有的风险。</p>
                <p>5.5加密货币的波动性</p>
                <p>您了解到，区块链技术和相关货币或代币由于许多因素（包括但不限于投机、技术和安全风险）而高度波动。您还承认，此类技术的交易成本是可变的，可能随时增加，从而对受支持区块链上发生的任何活动造成影响。您承认这些风险，并表示keypair不承担时间和成本波动的责任。</p>
                <p>5.6应用程序安全</p>
                <p>您承认区块链应用程序是存在缺陷的代码，并承认您完全负责评估服务提供的任何代码以及您通过服务访问或使用的任何第三方网站、产品、智能合约或内容的可信度。您进一步明确承认并表示，区块链应用程序可以恶意或疏忽地编写，keypair对您与此类应用程序的交互不承担责任，并且此类应用程序可能导致财产损失甚至身份损失。</p>
                <p>6.赔偿</p>
                <p>您同意赔偿keypair公司及其父母、子公司、附属公司和机构，以及上述任何实体的高级职员、董事、雇员、股东和代表，使其免受因您使用本服务、您违反本使用条款以及您的任何行为或疏忽而引起或导致的任何类型的索赔或行动造成的所有损失、责任、开支、损害、成本（包括律师费和因此产生的其他费用）。
                keypair保留对任何事项进行辩护权利，费用由您自行承担，在这种情况下，您同意配合keypair对该事项进行辩护。</p>
                <p>7.责任限制</p>
                <p>您承认并同意您对使用本网站和服务承担全部责任。您承认并同意，您在使用本网站和服务期间发送或接收的任何信息可能不安全，可能会被未经授权的各方拦截或获取。您承认并同意您使用本网站和服务的风险由您自己承担。您理解并同意，在适用法律允许的最大范围内，keypair公司及其供应商或许可方均不对您承担任何直接、间接、偶然、特殊、后果性、惩罚性、惩戒性或其他任何形式的损害赔偿，包括但不限于：利润损失、商誉损失的损害赔偿，使用、数据或其他有形或无形损失，任何由网站或服务引起的其他基于合同、侵权、严格责任或任何其他理论的损害（即使keypair已被告知此类损害的可能性）；使用或无法使用网站或服务；未经授权访问或更改您的传输服务或其他数据；现场或服务中任何第三方的陈述或行为；由于您发送给我们的通信而我们采取或未采取的任何行动；人为错误；技术故障；
                故障，包括公用设施或电话中断；任何设备或网络、提供商或软件（包括但不限于不允许参与服务的设备或网络、提供商或软件）的遗漏、中断、延迟、删除或缺陷；对计算机设备的任何伤害或损坏；无法完全访问网站或服务；盗窃、篡改、破坏或未经授权访问任何类型的图像或其他内容；处理延迟或错误、不完整或丢失的数据；印刷、打印或其他错误，或与网站或服务有关的任何其他事项。</p>
                <p>8.我们的所有权</p>
                <p>服务的所有所有权、所有权和知识产权归keypair公司。您承认并同意，本服务包含受知识产权和其他法律保护的专有和机密信息。除非keypair公司明确授权，否则您同意不复制、修改、出租、出租、出借、出售、分发、执行、展示或创建全部或部分基于服务的衍生作品。keypair为keypair的各种代码库颁发许可证，这些代码库可以在各自的存储库中找到。每个代码基可能具有不同的许可证。您可以在https://github.com/getkeypair上找到所有官方存储库。</p>
                <p>9.链接</p>
                <p>该服务提供或第三方可能提供指向其他可访问的互联网网站、应用程序或资源的链接。因为keypair可能无法控制这些网站、应用程序和资源，您承认并同意keypair对这些外部网站、应用程序或资源的可用性不负责任，并且不对此类网站或资源的任何内容、广告、产品或其他材料负责。
                您进一步承认并同意，对于因使用或依赖任何此类网站或资源上或通过任何此类网站或资源提供的任何此类内容、商品或服务而导致或声称造成的任何损害或损失，keypair公司不承担直接或间接责任。</p>
                <p>10.终止和暂停</p>
                <p>如果您违反了本条款的任何条款或条件，keypair可以立即终止或暂停全部或部分服务和您的keypair访问，而无需事先通知或承担责任。一旦您的访问终止，您使用服务的权利将立即终止。
                本条款的以下条款在本条款终止后仍然有效：赔偿；免责声明；责任限制；我们的所有权；链接；终止；无第三方受益人；有约束力的仲裁和集体诉讼弃权；一般信息。</p>
                <p>11.无第三方受益人</p>
                <p>您同意，除非本条款另有明确规定，本条款不存在第三方受益人。</p>
                <p>12.侵犯著作权的声明和程序</p>
                <p>如果您认为您的版权或授权代表您行使版权的人的版权受到侵犯，请向keypair公司版权代理提供包含以下信息的书面内容：</p>
                <p>•被授权代表版权或其他知识产权所有者行事的人员的电子签名或物理签名；</p>
                <p>•对您所声称的受版权保护的作品或其他知识产权的描述已被侵犯；</p>
                <p>•对您所声称的侵权材料位于服务上的描述；</p>
                <p>•您的地址、电话号码和电子邮件地址；</p>
                <p>•您声明您真诚地相信争议使用未经版权所有人、其代理人或法律授权；</p>
                <p>•您声明，在伪证处罚下，您的通知中的上述信息是准确的，并且您是版权所有人或知识产权所有人或被授权代表版权或知识产权所有人行事。</p>
                <p>keypair的版权代理可以联系到：</p>
                <p>电子邮件：copyright@get-keypair.com</p>
                <p>13.有约束力的仲裁和集体诉讼弃权</p>
                <p>请仔细阅读本节——它可能会严重影响您的合法权利，包括您向法院提起诉讼的权利。</p>
                <p>13.1初步争议解决</p>
                <p>双方应尽最大努力直接解决任何争议、索赔、问题或分歧，并进行诚信协商，这是任何一方提起诉讼或仲裁的条件。</p>
                <p>13.2仲裁</p>
                <p>如果双方在争议解决开始后的30天内未能达成一致的解决方案，则任何一方均可提起具有约束力的仲裁，作为解决索赔的唯一手段，但须遵守以下条款。具体而言，由这些条款（包括其构成、履行和违约）、双方关系和您使用服务引起的或与之相关的所有索赔，应由美国仲裁协会根据其商业仲裁规则的规定进行有约束力的仲裁最终解决。美国仲裁协会（以下简称“AAA”）有关消费者纠纷的仲裁规则和补充程序，不包括管辖或允许集体诉讼的任何规则或程序。
                仲裁员，而不是任何联邦、州或地方法院或机构，应具有排他性的权力，以解决因解释、适用性、可执行性或本条款的形成而产生的或与之相关的所有争议，包括但不限于任何声称本条款的全部或任何部分无效或可撤销，或索赔是否无效的索赔。仲裁员有权授予法院根据法律或衡平法可获得的任何救济。仲裁员的裁决应是书面的，对双方均有约束力，并可在任何有管辖权的法院作为判决。
                双方理解，如果没有这一强制性规定，他们将有权在法庭上起诉，并进行陪审团审判。他们进一步理解，在某些情况下，仲裁费用可能超过诉讼费用。</p>
                <p>13.3 位置</p>
                <p>有约束力的仲裁应在纽约进行。您同意服从纽约州纽约县任何联邦或州法院的个人管辖权，以强制仲裁、中止仲裁程序，或确认、修改、撤销或对仲裁员作出的裁决作出判决。</p>
                <p>13.4集体诉讼弃权</p>
                <p>双方进一步同意，任何仲裁只能以个人身份进行，不得作为集体诉讼或其他代表性诉讼，双方明确放弃其提起集体诉讼或寻求集体救济的权利。你方和keypair方同意，每一方只能以你方或其个人身份对另一方提出索赔，而不能以原告或任何声称的类别或代表性诉讼的类别成员的身份对另一方提出索赔。如果任何法院或仲裁员认为本款规定的集体诉讼弃权书因任何原因无效或不可执行，或者仲裁可以在集体基础上进行，则上述仲裁规定应被视为全部无效，双方应被视为未同意仲裁争议。</p>
                <p>13.5  例外情况——知识产权和小额索赔诉讼法院索赔</p>
                <p>尽管双方决定通过仲裁解决所有争议，但任何一方均可向州或联邦法院提起诉讼，以保护其知识产权（“知识产权”是指专利、版权、道德权利、商标和商业秘密，而非隐私权或宣传权）。任何一方也可以在小额索赔法院就该法院管辖范围内的争议或索赔寻求救济。</p>
                <p>13.6  30天退出权</p>
                <p>您有权选择退出，并且不受上述仲裁和集体诉讼豁免条款的约束，方法是将您决定退出的书面通知发送到以下电子邮件地址：legal-opt@get-keypair.com.。该通知必须在您首次使用服务后30天内发出，否则，您将有义务根据这些段落的条款仲裁争议。如果你选择退出这些仲裁条款，keypair也不受其约束。</p>
                <p>13.7 本节的变更</p>
                <p>对于本节的任何更改，将提前60天通知。变更将于第60天生效，并且仅适用于第60天之后产生的任何索赔。</p>
                <p>对于不受仲裁约束的任何争议，您和keypair公司同意服从位于纽约的联邦和州法院的个人和专属管辖权和审判地。您进一步同意接受邮寄送达，并在此放弃任何和所有管辖权和地点抗辩。</p>
                <p>您与keypair公司之间的条款和关系受纽约州法律管辖，不考虑法律条款冲突。</p>
                <p>14. 一般信息</p>
                <p>这些条款（以及keypair在服务上的任何附加条款、规则和条件）构成您与keypair在服务上的完整协议，并取代您与keypair在之前的任何口头或书面协议。</p>
                <p>14.2条款的放弃和可分割性</p>
                <p>keypair未能行使或执行本条款的任何权利或规定不构成对该权利或规定的放弃。如果有管辖权的仲裁员或法院发现条款中的任何条款无效，双方仍然同意仲裁员或法院应努力使条款中反映的双方意图生效，条款中的其他条款仍然完全有效。</p>
                <p>14.3限制状态</p>
                <p>请您同意，无论任何法令或法律有何相反规定，因使用服务或条款而产生或与之相关的任何索赔或诉讼理由必须在此类索赔或诉讼理由产生后一年内提出。</p>
                <p>14.4章节标题</p>
                <p>本条款中的章节标题仅为方便起见，不具有法律或合同效力。</p>
            </div>
        );
    }
}
